{
    "data":
    [
        {
            "id":1, 
            "title":"Asymmetric Encryption",
            "subtitle":"Explanation of Public key - Private key concept, with the math behind it , digital signing and usage of digital signing in verificating Bitcoin transactions.",
            "content":["We all have some knowledge on the concept of Public – Private Key (Asymmetric Encryption), but we don’t know how exactly it works. How is it possible for a key(Private) to decrypt message that is encrypted by a completely different key(Public). In this article I’ll explain the concept, the math behind the asymmetric encryption and how it is used in Blockchain(Especially in Bitcoin). \n\n\tBefore explaining the asymmetric encryption, first, let's look at the symmetric encryption so we can realize how helpful is it to avoid many security problems.\n\n  ",
            "In symmetric encryption we have two exact same keys, and lets say Bob and Alice our characters in our story, Bob wants to send a message (confidentially) to Alice. What would Bob do in that case if symmetric encryption concept is applied:\n\n\t1- Bob sends a key to Alice which is exact same of the one he has,\n\t2- Bob encrypts his message with his key and sends the message to Alice,\n\t3- Alice takes the message and decrpyts the message by using the key that Bob send to her.\n\nProblems of concept:\n\n\tThis seems quite fair but there is unignorable lack of security problems on that, a third guy Kevin who is our bad guy, listens the communication line between the Bob and Alice and he gets the key when Bob sends his key to Alice. Now Kevin can read any message that Bob encypts, because he also has the key and can decrypt the messages. He can also change the content of the message and encrypt the message again, send the new message to Alice, and for Alice there is no chance to figure out who write the message. \n\n\tWhat makes assymmetric encryption so special is that, asymmetric encryption avoids all of the security flaw in the story above. Now Lets look at the case that asymmetric encryption (Public and Private key ) concept is applied to send message in the story above.\n\n ",
            "\tThe word “Public” in Public key means there is no problem for others to have this key because Public key is used to encrypt messages and Private key is used to decrypt messages.\n\n \t1-Again, lets say Bob wants to send a message to Alice. Alice has two keys one is her Private key and one is her Public key, \n \t2- Alice sends her Public key to Bob,\n\t3- Bob writes the message and encrypts it with the Public key that Alice send to him, and sends the message back to Alice.\n \t4- Alice takes the message, decrypts it with her private key.\n\n\tIn this case the private key of Alice has not ever been send to anyone so there is no chance for it to be stolen. Since Public key is only used to encrypt messages there is no point on stealing the Public key, bad news for Kevin(bad guy in our story.)!\n\n\tFor Kevin, stealing the public key and sending fake messages to Alice is still a valid way to hack this system. Kevin can write a message, sign it with Alices’ Public key and send it to Alice. Alice can never know who send the message, or can she? There is another method to prevent this situation in asymmetric encryption, is digital signing. The digital signing is also used in validation check of Bitcoin transactions. Before explaining the digital signing lets look at the math behind the asymmetric encryption.\n\n ",
            "\n1- Select two primes p and q where p is not equal to q, \n \tLets say p = 7, q = 2\n\n 2- Calculate n = p x q,\n \tN = 7 * 2 = 14\n\n3- Calculate ϕ(n) euler totient of n,\n\tϕ(n)=(p−1)(q−1)=6*1=6\n\n4- Choose an exponent e that is relatively prime to ϕ(n) and satisfies the condition 1 < e < ϕ(n),\n\tThe pair (e,n) will be our public key, lets choose 5 as e.\n\n5- Calculate value for d,\n\te⋅d ≡ 1 modϕ(n)\n\tUsing the Extended Euclidean Algorithm, we can calculate one possible value for d is 11.\n\tThe pair (d,n) is our private key.\n\n6- Our public and private key pairs are: \n\tPub =(e,n)=(5,14)\n\tPriv =(d,n)=(11,14)\n\nNow we have generated our public and private keys. Let's encrypt a message to see how they works:\n\n1- To encrypt a message m, first convert it into a integer lets say 10. Then we calculate m^e mod n, and the result will be our encrypted message:\n\n\t10^e mod 14 is equal to 12. So our encrypted message is 12.\n\n2- Now lets decrypt the message with our private key. c^d mod n is supposed to give us the original message back where c is the encrypted message.\n\n\t c^d mod n = 12^11 mod 14 = 10. \n\nSo we have decrypted the message and obtain our initial message back which is 10.\n\n",
            "\tPart 2 is over here. We have covered symmetric key and asymmetric key concepts, and talked about the math behind the asymmetric encryption so far. The next part is about digital signing and usage of digital signing in validation of bitcoin transactions.\n\n\n"
            ],
            "headings":[
                "Part 1: Symmetric Encryption",
                "Part 2: Asymmetric Encryption ",
                "Generating public and private key ",
                "Part 3: Digital Signing – Verification of Bitcoin Transactions"
            ],
            "image": [
                "https://www.bitci.com/akademi/wp-content/uploads/2021/05/private-key-nedir-1.jpg",
                "https://static.packt-cdn.com/products/9781838986698/graphics/image/C13927_10_01.jpg",
                "https://www.ssl2buy.com/wiki/wp-content/uploads/2015/12/Asymmetric-Encryption.png",
                "https://www.researchgate.net/profile/Mohammed-Farik/publication/318729097/figure/fig2/AS:520924938342400@1501209591234/RSA-Public-Key-and-Private-Key-Generation-Method.png",
                "https://www.researchgate.net/profile/Anastasios-Kalogeropoulos/publication/328342750/figure/fig3/AS:682737052692487@1539788606950/Simplified-digitally-signed-transaction-on-blockchain.png"
            ],
            "date":"07/03/2022"
        }
    ]

}
